x1 = int(input("введите координаты первой строки: "))
y1 = int(input("введите координаты первого столбца: "))
x2 = int(input("введите координаты второй строки: "))
y2 = int(input("введите координаты второго столбца: "))

# Находим сумму координат для каждой клетки
cell_1 = x1 + y1
cell_2 = x2 + y2

# Проверяем цвет с помощью if-elif-else
# (у клеток одинаковый цвет, если суммы их координат оба чётные или оба нечётные)
if cell_1 % 2 == 0 and cell_2 % 2 == 0:
    print("клетки одинакого цвета")
elif cell_1 % 2 == 1 and cell_2 % 2 == 1:
    print("клетки одинакого цвета")
else:
    print("клетки разного цвета")