import random

pending = 1
processing = 2
shipped = 3
delivered = 4
cancelled = 5

days = random.randint(2,15)

status = int(input("Введите номер вашей операции: "))

match status:

    case 1:
        print("Статус: В ожидании ⌛")
        print("Описание: Ваш заказ успешно оформлен и ожидает подтверждения платежа")
        print("Примерное время ожидания в днях: ", days )

    case 2:
        print("Статус: В обработке 👨‍⚕️")
        print("Описание: Ваш заказ в процессе сборки")
        print("Примерное время ожидания в днях: ", days )

    case 3:
        print("Статус: Отправлено 🛫")
        print("Описание: Ваш заказ успешно отправлен и скоро приедет к вам!")
        print("Примерное время ожидания в днях: ", days )

    case 4:
        print("Статус: Доставлено ✅")
        print("Описание: Ваш заказ доставлен и уже вас заждался")
        print("Примерное время ожидания в днях: заказ ожидает вас ")

    case 5:
        print("Статус: Отменено ❌")
        print("Описание: К сожалению ваш заказ отменен, просим прощения за предоставленные неудобства")
        print("Примерное время ожидания в днях: 💤 " )
    case _:
        print("❗❌Введена некоректная информация❌❗")
